importは1つ目のセルに入れる。
依存ライブラリを明白にするため。

In [57]:
import os
import numpy as np
import pandas as pd

# データimport

In [58]:
for dirname, _, filenames in os.walk('../input/titanic'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

../input/titanic/test.csv
../input/titanic/train.csv

In [59]:
df_train = pd.read_csv('../input/titanic/train.csv')
df_train.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S

[5 rows x 12 columns]

In [60]:
df_test = pd.read_csv('../input/titanic/train.csv')
df_test.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S

[5 rows x 12 columns]

In [61]:
print(df_train.shape)

(891, 12)

In [62]:
df_train.describe()

       PassengerId    Survived     ...           Parch        Fare
count   891.000000  891.000000     ...      891.000000  891.000000
mean    446.000000    0.383838     ...        0.381594   32.204208
std     257.353842    0.486592     ...        0.806057   49.693429
min       1.000000    0.000000     ...        0.000000    0.000000
25%     223.500000    0.000000     ...        0.000000    7.910400
50%     446.000000    0.000000     ...        0.000000   14.454200
75%     668.500000    1.000000     ...        0.000000   31.000000
max     891.000000    1.000000     ...        6.000000  512.329200

[8 rows x 7 columns]

In [63]:
null_val=df_train.isnull().sum()
null_val

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# データ整形

文字列データを数値に変換する。

```
df.loc[条件, 列] = 列への代入値
```
を用いる。

In [64]:
def convert_string_to_number(df):
    df.loc[df['Sex'] == 'male', 'n_Sex'] = 0
    df.loc[df['Sex'] == 'female', 'n_Sex'] = 1
    df.loc[df['Embarked'] == 'S', 'n_Embarked'] = 0
    df.loc[df['Embarked'] == 'C', 'n_Embarked'] = 1
    df.loc[df['Embarked'] == 'Q', 'n_Embarked'] = 2
    return df

df_train = convert_string_to_number(df_train)
df_train.head()

   PassengerId  Survived  Pclass     ...     Embarked n_Sex  n_Embarked
0            1         0       3     ...            S   0.0         0.0
1            2         1       1     ...            C   1.0         1.0
2            3         1       3     ...            S   1.0         0.0
3            4         1       1     ...            S   1.0         0.0
4            5         0       3     ...            S   0.0         0.0

[5 rows x 14 columns]

欠損データを保管する。

```
df['列'].fillna(保管データ)
```

を用いる。

In [65]:
def store_null_to_median(df):
    df['Age'] = df['Age'].fillna(df['Age'].median())
    df['n_Embarked'] = df['n_Embarked'].fillna(df['n_Embarked'].median())
    return df
    
df_train = store_null_to_median(df_train)
df_train.head()

   PassengerId  Survived  Pclass     ...     Embarked n_Sex  n_Embarked
0            1         0       3     ...            S   0.0         0.0
1            2         1       1     ...            C   1.0         1.0
2            3         1       3     ...            S   1.0         0.0
3            4         1       1     ...            S   1.0         0.0
4            5         0       3     ...            S   0.0         0.0

[5 rows x 14 columns]

In [66]:
null_val=df_train.isnull().sum()
null_val

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
n_Sex            0
n_Embarked       0
dtype: int64